---
kind: method
id: M:Autodesk.Revit.DB.AlphanumericRevisionSettings.Dispose
source: html/127028b0-93b0-d2df-1cbb-52df4a874093.htm
---
# Autodesk.Revit.DB.AlphanumericRevisionSettings.Dispose Method

Releases all resources used by the AlphanumericRevisionSettings

## Syntax (C#)
```csharp
public void Dispose()
```